Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC00/include/component/hmatrix2.h
#define HMATRIX2_MEIDR_MERR_Pos               _UINT32_(0)                                          /* (HMATRIX2_MEIDR Position) Master x5 Access Error */
#define HMATRIX2_MEIDR_MERR_Msk               (_UINT32_(0xFFFF) << HMATRIX2_MEIDR_MERR_Pos)        /* (HMATRIX2_MEIDR Mask) MERR */
#define HMATRIX2_MEIDR_MERR(value)            (HMATRIX2_MEIDR_MERR_Msk & (_UINT32_(value) << HMATRIX2_MEIDR_MERR_Pos)) 

/* -------- HMATRIX2_MEIMR : (HMATRIX2 Offset: 0x158) ( R/ 32) Master Error Interrupt Mask -------- */
#define HMATRIX2_MEIMR_MERR0_Pos              _UINT32_(0)                                          /* (HMATRIX2_MEIMR) Master 0 Access Error Position */
#define HMATRIX2_MEIMR_MERR0_Msk              (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR0_Pos)          /* (HMATRIX2_MEIMR) Master 0 Access Error Mask */
#define HMATRIX2_MEIMR_MERR0(value)           (HMATRIX2_MEIMR_MERR0_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR0_Pos)) /* Assigment of value for MERR0 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR1_Pos              _UINT32_(1)                                          /* (HMATRIX2_MEIMR) Master 1 Access Error Position */
#define HMATRIX2_MEIMR_MERR1_Msk              (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR1_Pos)          /* (HMATRIX2_MEIMR) Master 1 Access Error Mask */
#define HMATRIX2_MEIMR_MERR1(value)           (HMATRIX2_MEIMR_MERR1_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR1_Pos)) /* Assigment of value for MERR1 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR2_Pos              _UINT32_(2)                                          /* (HMATRIX2_MEIMR) Master 2 Access Error Position */
#define HMATRIX2_MEIMR_MERR2_Msk              (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR2_Pos)          /* (HMATRIX2_MEIMR) Master 2 Access Error Mask */
#define HMATRIX2_MEIMR_MERR2(value)           (HMATRIX2_MEIMR_MERR2_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR2_Pos)) /* Assigment of value for MERR2 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR3_Pos              _UINT32_(3)                                          /* (HMATRIX2_MEIMR) Master 3 Access Error Position */
#define HMATRIX2_MEIMR_MERR3_Msk              (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR3_Pos)          /* (HMATRIX2_MEIMR) Master 3 Access Error Mask */
#define HMATRIX2_MEIMR_MERR3(value)           (HMATRIX2_MEIMR_MERR3_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR3_Pos)) /* Assigment of value for MERR3 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR4_Pos              _UINT32_(4)                                          /* (HMATRIX2_MEIMR) Master 4 Access Error Position */
#define HMATRIX2_MEIMR_MERR4_Msk              (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR4_Pos)          /* (HMATRIX2_MEIMR) Master 4 Access Error Mask */
#define HMATRIX2_MEIMR_MERR4(value)           (HMATRIX2_MEIMR_MERR4_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR4_Pos)) /* Assigment of value for MERR4 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR5_Pos              _UINT32_(5)                                          /* (HMATRIX2_MEIMR) Master 5 Access Error Position */
#define HMATRIX2_MEIMR_MERR5_Msk              (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR5_Pos)          /* (HMATRIX2_MEIMR) Master 5 Access Error Mask */
#define HMATRIX2_MEIMR_MERR5(value)           (HMATRIX2_MEIMR_MERR5_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR5_Pos)) /* Assigment of value for MERR5 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR6_Pos              _UINT32_(6)                                          /* (HMATRIX2_MEIMR) Master 6 Access Error Position */
#define HMATRIX2_MEIMR_MERR6_Msk              (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR6_Pos)          /* (HMATRIX2_MEIMR) Master 6 Access Error Mask */
#define HMATRIX2_MEIMR_MERR6(value)           (HMATRIX2_MEIMR_MERR6_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR6_Pos)) /* Assigment of value for MERR6 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR7_Pos              _UINT32_(7)                                          /* (HMATRIX2_MEIMR) Master 7 Access Error Position */
#define HMATRIX2_MEIMR_MERR7_Msk              (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR7_Pos)          /* (HMATRIX2_MEIMR) Master 7 Access Error Mask */
#define HMATRIX2_MEIMR_MERR7(value)           (HMATRIX2_MEIMR_MERR7_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR7_Pos)) /* Assigment of value for MERR7 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR8_Pos              _UINT32_(8)                                          /* (HMATRIX2_MEIMR) Master 8 Access Error Position */
#define HMATRIX2_MEIMR_MERR8_Msk              (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR8_Pos)          /* (HMATRIX2_MEIMR) Master 8 Access Error Mask */
#define HMATRIX2_MEIMR_MERR8(value)           (HMATRIX2_MEIMR_MERR8_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR8_Pos)) /* Assigment of value for MERR8 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR9_Pos              _UINT32_(9)                                          /* (HMATRIX2_MEIMR) Master 9 Access Error Position */
#define HMATRIX2_MEIMR_MERR9_Msk              (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR9_Pos)          /* (HMATRIX2_MEIMR) Master 9 Access Error Mask */
#define HMATRIX2_MEIMR_MERR9(value)           (HMATRIX2_MEIMR_MERR9_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR9_Pos)) /* Assigment of value for MERR9 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR10_Pos             _UINT32_(10)                                         /* (HMATRIX2_MEIMR) Master 10 Access Error Position */
#define HMATRIX2_MEIMR_MERR10_Msk             (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR10_Pos)         /* (HMATRIX2_MEIMR) Master 10 Access Error Mask */
#define HMATRIX2_MEIMR_MERR10(value)          (HMATRIX2_MEIMR_MERR10_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR10_Pos)) /* Assigment of value for MERR10 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR11_Pos             _UINT32_(11)                                         /* (HMATRIX2_MEIMR) Master 11 Access Error Position */
#define HMATRIX2_MEIMR_MERR11_Msk             (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR11_Pos)         /* (HMATRIX2_MEIMR) Master 11 Access Error Mask */
#define HMATRIX2_MEIMR_MERR11(value)          (HMATRIX2_MEIMR_MERR11_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR11_Pos)) /* Assigment of value for MERR11 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR12_Pos             _UINT32_(12)                                         /* (HMATRIX2_MEIMR) Master 12 Access Error Position */
#define HMATRIX2_MEIMR_MERR12_Msk             (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR12_Pos)         /* (HMATRIX2_MEIMR) Master 12 Access Error Mask */
#define HMATRIX2_MEIMR_MERR12(value)          (HMATRIX2_MEIMR_MERR12_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR12_Pos)) /* Assigment of value for MERR12 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR13_Pos             _UINT32_(13)                                         /* (HMATRIX2_MEIMR) Master 13 Access Error Position */
#define HMATRIX2_MEIMR_MERR13_Msk             (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR13_Pos)         /* (HMATRIX2_MEIMR) Master 13 Access Error Mask */
#define HMATRIX2_MEIMR_MERR13(value)          (HMATRIX2_MEIMR_MERR13_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR13_Pos)) /* Assigment of value for MERR13 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR14_Pos             _UINT32_(14)                                         /* (HMATRIX2_MEIMR) Master 14 Access Error Position */
#define HMATRIX2_MEIMR_MERR14_Msk             (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR14_Pos)         /* (HMATRIX2_MEIMR) Master 14 Access Error Mask */
#define HMATRIX2_MEIMR_MERR14(value)          (HMATRIX2_MEIMR_MERR14_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR14_Pos)) /* Assigment of value for MERR14 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_MERR15_Pos             _UINT32_(15)                                         /* (HMATRIX2_MEIMR) Master 15 Access Error Position */
#define HMATRIX2_MEIMR_MERR15_Msk             (_UINT32_(0x1) << HMATRIX2_MEIMR_MERR15_Pos)         /* (HMATRIX2_MEIMR) Master 15 Access Error Mask */
#define HMATRIX2_MEIMR_MERR15(value)          (HMATRIX2_MEIMR_MERR15_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR15_Pos)) /* Assigment of value for MERR15 in the HMATRIX2_MEIMR register */
#define HMATRIX2_MEIMR_Msk                    _UINT32_(0x0000FFFF)                                 /* (HMATRIX2_MEIMR) Register Mask  */

#define HMATRIX2_MEIMR_MERR_Pos               _UINT32_(0)                                          /* (HMATRIX2_MEIMR Position) Master x5 Access Error */
#define HMATRIX2_MEIMR_MERR_Msk               (_UINT32_(0xFFFF) << HMATRIX2_MEIMR_MERR_Pos)        /* (HMATRIX2_MEIMR Mask) MERR */
#define HMATRIX2_MEIMR_MERR(value)            (HMATRIX2_MEIMR_MERR_Msk & (_UINT32_(value) << HMATRIX2_MEIMR_MERR_Pos)) 

/* -------- HMATRIX2_MESR : (HMATRIX2 Offset: 0x15C) ( R/ 32) Master Error Status -------- */
#define HMATRIX2_MESR_MERR0_Pos               _UINT32_(0)                                          /* (HMATRIX2_MESR) Master 0 Access Error Position */
#define HMATRIX2_MESR_MERR0_Msk               (_UINT32_(0x1) << HMATRIX2_MESR_MERR0_Pos)           /* (HMATRIX2_MESR) Master 0 Access Error Mask */
#define HMATRIX2_MESR_MERR0(value)            (HMATRIX2_MESR_MERR0_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR0_Pos)) /* Assigment of value for MERR0 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR1_Pos               _UINT32_(1)                                          /* (HMATRIX2_MESR) Master 1 Access Error Position */
#define HMATRIX2_MESR_MERR1_Msk               (_UINT32_(0x1) << HMATRIX2_MESR_MERR1_Pos)           /* (HMATRIX2_MESR) Master 1 Access Error Mask */
#define HMATRIX2_MESR_MERR1(value)            (HMATRIX2_MESR_MERR1_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR1_Pos)) /* Assigment of value for MERR1 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR2_Pos               _UINT32_(2)                                          /* (HMATRIX2_MESR) Master 2 Access Error Position */
#define HMATRIX2_MESR_MERR2_Msk               (_UINT32_(0x1) << HMATRIX2_MESR_MERR2_Pos)           /* (HMATRIX2_MESR) Master 2 Access Error Mask */
#define HMATRIX2_MESR_MERR2(value)            (HMATRIX2_MESR_MERR2_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR2_Pos)) /* Assigment of value for MERR2 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR3_Pos               _UINT32_(3)                                          /* (HMATRIX2_MESR) Master 3 Access Error Position */
#define HMATRIX2_MESR_MERR3_Msk               (_UINT32_(0x1) << HMATRIX2_MESR_MERR3_Pos)           /* (HMATRIX2_MESR) Master 3 Access Error Mask */
#define HMATRIX2_MESR_MERR3(value)            (HMATRIX2_MESR_MERR3_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR3_Pos)) /* Assigment of value for MERR3 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR4_Pos               _UINT32_(4)                                          /* (HMATRIX2_MESR) Master 4 Access Error Position */
#define HMATRIX2_MESR_MERR4_Msk               (_UINT32_(0x1) << HMATRIX2_MESR_MERR4_Pos)           /* (HMATRIX2_MESR) Master 4 Access Error Mask */
#define HMATRIX2_MESR_MERR4(value)            (HMATRIX2_MESR_MERR4_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR4_Pos)) /* Assigment of value for MERR4 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR5_Pos               _UINT32_(5)                                          /* (HMATRIX2_MESR) Master 5 Access Error Position */
#define HMATRIX2_MESR_MERR5_Msk               (_UINT32_(0x1) << HMATRIX2_MESR_MERR5_Pos)           /* (HMATRIX2_MESR) Master 5 Access Error Mask */
#define HMATRIX2_MESR_MERR5(value)            (HMATRIX2_MESR_MERR5_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR5_Pos)) /* Assigment of value for MERR5 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR6_Pos               _UINT32_(6)                                          /* (HMATRIX2_MESR) Master 6 Access Error Position */
#define HMATRIX2_MESR_MERR6_Msk               (_UINT32_(0x1) << HMATRIX2_MESR_MERR6_Pos)           /* (HMATRIX2_MESR) Master 6 Access Error Mask */
#define HMATRIX2_MESR_MERR6(value)            (HMATRIX2_MESR_MERR6_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR6_Pos)) /* Assigment of value for MERR6 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR7_Pos               _UINT32_(7)                                          /* (HMATRIX2_MESR) Master 7 Access Error Position */
#define HMATRIX2_MESR_MERR7_Msk               (_UINT32_(0x1) << HMATRIX2_MESR_MERR7_Pos)           /* (HMATRIX2_MESR) Master 7 Access Error Mask */
#define HMATRIX2_MESR_MERR7(value)            (HMATRIX2_MESR_MERR7_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR7_Pos)) /* Assigment of value for MERR7 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR8_Pos               _UINT32_(8)                                          /* (HMATRIX2_MESR) Master 8 Access Error Position */
#define HMATRIX2_MESR_MERR8_Msk               (_UINT32_(0x1) << HMATRIX2_MESR_MERR8_Pos)           /* (HMATRIX2_MESR) Master 8 Access Error Mask */
#define HMATRIX2_MESR_MERR8(value)            (HMATRIX2_MESR_MERR8_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR8_Pos)) /* Assigment of value for MERR8 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR9_Pos               _UINT32_(9)                                          /* (HMATRIX2_MESR) Master 9 Access Error Position */
#define HMATRIX2_MESR_MERR9_Msk               (_UINT32_(0x1) << HMATRIX2_MESR_MERR9_Pos)           /* (HMATRIX2_MESR) Master 9 Access Error Mask */
#define HMATRIX2_MESR_MERR9(value)            (HMATRIX2_MESR_MERR9_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR9_Pos)) /* Assigment of value for MERR9 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR10_Pos              _UINT32_(10)                                         /* (HMATRIX2_MESR) Master 10 Access Error Position */
#define HMATRIX2_MESR_MERR10_Msk              (_UINT32_(0x1) << HMATRIX2_MESR_MERR10_Pos)          /* (HMATRIX2_MESR) Master 10 Access Error Mask */
#define HMATRIX2_MESR_MERR10(value)           (HMATRIX2_MESR_MERR10_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR10_Pos)) /* Assigment of value for MERR10 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR11_Pos              _UINT32_(11)                                         /* (HMATRIX2_MESR) Master 11 Access Error Position */
#define HMATRIX2_MESR_MERR11_Msk              (_UINT32_(0x1) << HMATRIX2_MESR_MERR11_Pos)          /* (HMATRIX2_MESR) Master 11 Access Error Mask */
#define HMATRIX2_MESR_MERR11(value)           (HMATRIX2_MESR_MERR11_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR11_Pos)) /* Assigment of value for MERR11 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR12_Pos              _UINT32_(12)                                         /* (HMATRIX2_MESR) Master 12 Access Error Position */
#define HMATRIX2_MESR_MERR12_Msk              (_UINT32_(0x1) << HMATRIX2_MESR_MERR12_Pos)          /* (HMATRIX2_MESR) Master 12 Access Error Mask */
#define HMATRIX2_MESR_MERR12(value)           (HMATRIX2_MESR_MERR12_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR12_Pos)) /* Assigment of value for MERR12 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR13_Pos              _UINT32_(13)                                         /* (HMATRIX2_MESR) Master 13 Access Error Position */
#define HMATRIX2_MESR_MERR13_Msk              (_UINT32_(0x1) << HMATRIX2_MESR_MERR13_Pos)          /* (HMATRIX2_MESR) Master 13 Access Error Mask */
#define HMATRIX2_MESR_MERR13(value)           (HMATRIX2_MESR_MERR13_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR13_Pos)) /* Assigment of value for MERR13 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR14_Pos              _UINT32_(14)                                         /* (HMATRIX2_MESR) Master 14 Access Error Position */
#define HMATRIX2_MESR_MERR14_Msk              (_UINT32_(0x1) << HMATRIX2_MESR_MERR14_Pos)          /* (HMATRIX2_MESR) Master 14 Access Error Mask */
#define HMATRIX2_MESR_MERR14(value)           (HMATRIX2_MESR_MERR14_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR14_Pos)) /* Assigment of value for MERR14 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_MERR15_Pos              _UINT32_(15)                                         /* (HMATRIX2_MESR) Master 15 Access Error Position */
#define HMATRIX2_MESR_MERR15_Msk              (_UINT32_(0x1) << HMATRIX2_MESR_MERR15_Pos)          /* (HMATRIX2_MESR) Master 15 Access Error Mask */
#define HMATRIX2_MESR_MERR15(value)           (HMATRIX2_MESR_MERR15_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR15_Pos)) /* Assigment of value for MERR15 in the HMATRIX2_MESR register */
#define HMATRIX2_MESR_Msk                     _UINT32_(0x0000FFFF)                                 /* (HMATRIX2_MESR) Register Mask  */

#define HMATRIX2_MESR_MERR_Pos                _UINT32_(0)                                          /* (HMATRIX2_MESR Position) Master x5 Access Error */
#define HMATRIX2_MESR_MERR_Msk                (_UINT32_(0xFFFF) << HMATRIX2_MESR_MERR_Pos)         /* (HMATRIX2_MESR Mask) MERR */
#define HMATRIX2_MESR_MERR(value)             (HMATRIX2_MESR_MERR_Msk & (_UINT32_(value) << HMATRIX2_MESR_MERR_Pos)) 

/* -------- HMATRIX2_MEAR : (HMATRIX2 Offset: 0x160) ( R/ 32) Master Error Address -------- */
#define HMATRIX2_MEAR_Msk                     _UINT32_(0x00000000)                                 /* (HMATRIX2_MEAR) Register Mask  */


