Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC00/include/component/hmatrix2.h
/** \brief HMATRIX2 register offsets definitions */
#define HMATRIX2_PRAS_REG_OFST         _UINT32_(0x00)      /* (HMATRIX2_PRAS) Priority A for Slave Offset */
#define HMATRIX2_PRBS_REG_OFST         _UINT32_(0x04)      /* (HMATRIX2_PRBS) Priority B for Slave Offset */
#define HMATRIX2_MCFG_REG_OFST         _UINT32_(0x00)      /* (HMATRIX2_MCFG) Master Configuration Offset */
#define HMATRIX2_MCFG0_REG_OFST        _UINT32_(0x00)      /* (HMATRIX2_MCFG0) Master Configuration Offset */
#define HMATRIX2_MCFG1_REG_OFST        _UINT32_(0x04)      /* (HMATRIX2_MCFG1) Master Configuration Offset */
#define HMATRIX2_MCFG2_REG_OFST        _UINT32_(0x08)      /* (HMATRIX2_MCFG2) Master Configuration Offset */
#define HMATRIX2_MCFG3_REG_OFST        _UINT32_(0x0C)      /* (HMATRIX2_MCFG3) Master Configuration Offset */
#define HMATRIX2_MCFG4_REG_OFST        _UINT32_(0x10)      /* (HMATRIX2_MCFG4) Master Configuration Offset */
#define HMATRIX2_MCFG5_REG_OFST        _UINT32_(0x14)      /* (HMATRIX2_MCFG5) Master Configuration Offset */
#define HMATRIX2_MCFG6_REG_OFST        _UINT32_(0x18)      /* (HMATRIX2_MCFG6) Master Configuration Offset */
#define HMATRIX2_MCFG7_REG_OFST        _UINT32_(0x1C)      /* (HMATRIX2_MCFG7) Master Configuration Offset */
#define HMATRIX2_MCFG8_REG_OFST        _UINT32_(0x20)      /* (HMATRIX2_MCFG8) Master Configuration Offset */
#define HMATRIX2_MCFG9_REG_OFST        _UINT32_(0x24)      /* (HMATRIX2_MCFG9) Master Configuration Offset */
#define HMATRIX2_MCFG10_REG_OFST       _UINT32_(0x28)      /* (HMATRIX2_MCFG10) Master Configuration Offset */
#define HMATRIX2_MCFG11_REG_OFST       _UINT32_(0x2C)      /* (HMATRIX2_MCFG11) Master Configuration Offset */
#define HMATRIX2_MCFG12_REG_OFST       _UINT32_(0x30)      /* (HMATRIX2_MCFG12) Master Configuration Offset */
#define HMATRIX2_MCFG13_REG_OFST       _UINT32_(0x34)      /* (HMATRIX2_MCFG13) Master Configuration Offset */
#define HMATRIX2_MCFG14_REG_OFST       _UINT32_(0x38)      /* (HMATRIX2_MCFG14) Master Configuration Offset */
#define HMATRIX2_MCFG15_REG_OFST       _UINT32_(0x3C)      /* (HMATRIX2_MCFG15) Master Configuration Offset */
#define HMATRIX2_SCFG_REG_OFST         _UINT32_(0x40)      /* (HMATRIX2_SCFG) Slave Configuration Offset */
#define HMATRIX2_SCFG0_REG_OFST        _UINT32_(0x40)      /* (HMATRIX2_SCFG0) Slave Configuration Offset */
#define HMATRIX2_SCFG1_REG_OFST        _UINT32_(0x44)      /* (HMATRIX2_SCFG1) Slave Configuration Offset */
#define HMATRIX2_SCFG2_REG_OFST        _UINT32_(0x48)      /* (HMATRIX2_SCFG2) Slave Configuration Offset */
#define HMATRIX2_SCFG3_REG_OFST        _UINT32_(0x4C)      /* (HMATRIX2_SCFG3) Slave Configuration Offset */
#define HMATRIX2_SCFG4_REG_OFST        _UINT32_(0x50)      /* (HMATRIX2_SCFG4) Slave Configuration Offset */
#define HMATRIX2_SCFG5_REG_OFST        _UINT32_(0x54)      /* (HMATRIX2_SCFG5) Slave Configuration Offset */
#define HMATRIX2_SCFG6_REG_OFST        _UINT32_(0x58)      /* (HMATRIX2_SCFG6) Slave Configuration Offset */
#define HMATRIX2_SCFG7_REG_OFST        _UINT32_(0x5C)      /* (HMATRIX2_SCFG7) Slave Configuration Offset */
#define HMATRIX2_SCFG8_REG_OFST        _UINT32_(0x60)      /* (HMATRIX2_SCFG8) Slave Configuration Offset */
#define HMATRIX2_SCFG9_REG_OFST        _UINT32_(0x64)      /* (HMATRIX2_SCFG9) Slave Configuration Offset */
#define HMATRIX2_SCFG10_REG_OFST       _UINT32_(0x68)      /* (HMATRIX2_SCFG10) Slave Configuration Offset */
#define HMATRIX2_SCFG11_REG_OFST       _UINT32_(0x6C)      /* (HMATRIX2_SCFG11) Slave Configuration Offset */
#define HMATRIX2_SCFG12_REG_OFST       _UINT32_(0x70)      /* (HMATRIX2_SCFG12) Slave Configuration Offset */
#define HMATRIX2_MRCR_REG_OFST         _UINT32_(0x100)     /* (HMATRIX2_MRCR) Master Remap Control Offset */
#define HMATRIX2_SFR_REG_OFST          _UINT32_(0x110)     /* (HMATRIX2_SFR) Special Function Offset */
#define HMATRIX2_SFR0_REG_OFST         _UINT32_(0x110)     /* (HMATRIX2_SFR0) Special Function Offset */
#define HMATRIX2_SFR1_REG_OFST         _UINT32_(0x114)     /* (HMATRIX2_SFR1) Special Function Offset */
#define HMATRIX2_SFR2_REG_OFST         _UINT32_(0x118)     /* (HMATRIX2_SFR2) Special Function Offset */
#define HMATRIX2_SFR3_REG_OFST         _UINT32_(0x11C)     /* (HMATRIX2_SFR3) Special Function Offset */
#define HMATRIX2_SFR4_REG_OFST         _UINT32_(0x120)     /* (HMATRIX2_SFR4) Special Function Offset */
#define HMATRIX2_SFR5_REG_OFST         _UINT32_(0x124)     /* (HMATRIX2_SFR5) Special Function Offset */
#define HMATRIX2_SFR6_REG_OFST         _UINT32_(0x128)     /* (HMATRIX2_SFR6) Special Function Offset */
#define HMATRIX2_SFR7_REG_OFST         _UINT32_(0x12C)     /* (HMATRIX2_SFR7) Special Function Offset */
#define HMATRIX2_SFR8_REG_OFST         _UINT32_(0x130)     /* (HMATRIX2_SFR8) Special Function Offset */
#define HMATRIX2_SFR9_REG_OFST         _UINT32_(0x134)     /* (HMATRIX2_SFR9) Special Function Offset */
#define HMATRIX2_SFR10_REG_OFST        _UINT32_(0x138)     /* (HMATRIX2_SFR10) Special Function Offset */
#define HMATRIX2_SFR11_REG_OFST        _UINT32_(0x13C)     /* (HMATRIX2_SFR11) Special Function Offset */
#define HMATRIX2_SFR12_REG_OFST        _UINT32_(0x140)     /* (HMATRIX2_SFR12) Special Function Offset */
#define HMATRIX2_MEIER_REG_OFST        _UINT32_(0x150)     /* (HMATRIX2_MEIER) Master Error Interrupt Enable Offset */
#define HMATRIX2_MEIDR_REG_OFST        _UINT32_(0x154)     /* (HMATRIX2_MEIDR) Master Error Interrupt Disable Offset */
#define HMATRIX2_MEIMR_REG_OFST        _UINT32_(0x158)     /* (HMATRIX2_MEIMR) Master Error Interrupt Mask Offset */
#define HMATRIX2_MESR_REG_OFST         _UINT32_(0x15C)     /* (HMATRIX2_MESR) Master Error Status Offset */
#define HMATRIX2_MEAR_REG_OFST         _UINT32_(0x160)     /* (HMATRIX2_MEAR) Master Error Address Offset */
#define HMATRIX2_MEAR0_REG_OFST        _UINT32_(0x160)     /* (HMATRIX2_MEAR0) Master Error Address Offset */
#define HMATRIX2_MEAR1_REG_OFST        _UINT32_(0x164)     /* (HMATRIX2_MEAR1) Master Error Address Offset */
#define HMATRIX2_MEAR2_REG_OFST        _UINT32_(0x168)     /* (HMATRIX2_MEAR2) Master Error Address Offset */
#define HMATRIX2_MEAR3_REG_OFST        _UINT32_(0x16C)     /* (HMATRIX2_MEAR3) Master Error Address Offset */
#define HMATRIX2_MEAR4_REG_OFST        _UINT32_(0x170)     /* (HMATRIX2_MEAR4) Master Error Address Offset */
#define HMATRIX2_MEAR5_REG_OFST        _UINT32_(0x174)     /* (HMATRIX2_MEAR5) Master Error Address Offset */
#define HMATRIX2_MEAR6_REG_OFST        _UINT32_(0x178)     /* (HMATRIX2_MEAR6) Master Error Address Offset */
#define HMATRIX2_MEAR7_REG_OFST        _UINT32_(0x17C)     /* (HMATRIX2_MEAR7) Master Error Address Offset */
#define HMATRIX2_MEAR8_REG_OFST        _UINT32_(0x180)     /* (HMATRIX2_MEAR8) Master Error Address Offset */
#define HMATRIX2_MEAR9_REG_OFST        _UINT32_(0x184)     /* (HMATRIX2_MEAR9) Master Error Address Offset */
#define HMATRIX2_MEAR10_REG_OFST       _UINT32_(0x188)     /* (HMATRIX2_MEAR10) Master Error Address Offset */
#define HMATRIX2_MEAR11_REG_OFST       _UINT32_(0x18C)     /* (HMATRIX2_MEAR11) Master Error Address Offset */
#define HMATRIX2_MEAR12_REG_OFST       _UINT32_(0x190)     /* (HMATRIX2_MEAR12) Master Error Address Offset */
#define HMATRIX2_MEAR13_REG_OFST       _UINT32_(0x194)     /* (HMATRIX2_MEAR13) Master Error Address Offset */
#define HMATRIX2_MEAR14_REG_OFST       _UINT32_(0x198)     /* (HMATRIX2_MEAR14) Master Error Address Offset */
#define HMATRIX2_MEAR15_REG_OFST       _UINT32_(0x19C)     /* (HMATRIX2_MEAR15) Master Error Address Offset */

